Revit 2024 API
PanelScheduleTemplate.IsBranchPanelSchedule Property
 Checks to see if this object is branch panel schedule template element.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsBranchPanelSchedule { get; }
Visual Basic
Public ReadOnly Property IsBranchPanelSchedule As Boolean
	Get
Visual C++
public:
property bool IsBranchPanelSchedule {
	bool get ();
}
See Also
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace